proj-demo/app/controllers/fluffys_controller.rb

SELECT "fluffys".* FROM "fluffys"
---
  def get_rewards
      @fluffy = Fluffys.all