proj-launch/app/controllers/fluffys_controller.rb

  def show
    print 123
    id = params[:id] # retrieve movie ID from URI route
    @fluffy = Fluffys.find(id) # look up movie by unique ID
---
SELECT  "fluffys".* FROM "fluffys" WHERE "fluffys"."id" = ? LIMIT 1  [["id", 0]]

  def index
    @fluffy = Fluffys.all
    @events = Events.all
---
SELECT "fluffys".* FROM "fluffys"
SELECT "events".* FROM "events"

  def recommend
    id = params[:id]
    password = params[:password]
    @result = "bye"
    @events = Events.all
---
SELECT "events".* FROM "events"

  def create
    #@new_fluffy = Fluffys.new(:name => movie_params.name, :budget => movie_params.budget, :remaining_budget => movie_params.remaining_budget, :fluffy_coin => '0')
    print("params")
    print(params)
    if params[:commit] == "Save Changes"
        #new_params = fluffy_params.merge!(:fluffy_coin => '0')
        new_params = Fluffys.merge_parm(fluffy_params)
        @fluffy = Fluffys.create!(new_params)
---
INSERT INTO "fluffys" ("name", "budget", "remaining_budget", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Jeery"], ["budget", "100"], ["remaining_budget", "100"], ["password", "hellor"], ["created_at", "2021-03-25 17:28:22.384219"], ["updated_at", "2021-03-25 17:28:22.384219"]]

  def pay
      @fluffy = Fluffys.find params[:id]
      remaining_budget = @fluffy.remaining_budget.to_i
      fluffy_coin = @fluffy.fluffy_coin.to_i
      budget = params[:budget].to_i
      @fluffy.remaining_budget = remaining_budget + fluffy_coin - budget
      @fluffy.fluffy_coin = budget * 0.05
      @fluffy.save
---
SELECT  "fluffys".* FROM "fluffys" WHERE "fluffys"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "fluffys" SET "remaining_budget" = ?, "fluffy_coin" = ?, "updated_at" = ? WHERE "fluffys"."id" = ?  [["remaining_budget", "380"], ["fluffy_coin", "2.5"], ["updated_at", "2021-04-17 03:32:51.414572"], ["id", 1]]

  def get_rewards
      #@fluffy = Fluffys.all
      #Fluffys.update_fluffy_coin
      #redirect_to fluffys_path
      @fluffy = Fluffys.find(params[:id])
      Fluffys.update_fluffy_coin(@fluffy)
---
SELECT  "fluffys".* FROM "fluffys" WHERE "fluffys"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "fluffys" SET "fluffy_coin" = ?, "updated_at" = ? WHERE "fluffys"."id" = ?  [["fluffy_coin", "999"], ["updated_at", "2021-03-11 16:00:41.504070"], ["id", 1]]

  def user
      id = Integer(params[:id])
      @events = Events.all
      if Fluffys.is_outofRange(id)
          flash[:notice] = "User ID Does not exsit"
          redirect_to fluffys_path
      elsif Fluffys.is_too_small(id)
          flash[:notice] = "User ID can not be smaller than 1"
          redirect_to fluffys_path
      else
          @fluffy = Fluffys.find params[:id]
---
SELECT "events".* FROM "events"
SELECT  "fluffys".* FROM "fluffys" WHERE "fluffys"."id" = ? LIMIT 1  [["id", 1]]

  def reset_rewards
      #Fluffys.reset_fluffy_coin
      #redirect_to fluffys_path
      @fluffy = Fluffys.find(params[:id])
---
SELECT  "fluffys".* FROM "fluffys" WHERE "fluffys"."id" = ? LIMIT 1  [["id", 1]]